In [1]:
from datetime import datetime
import pandas as pd
import extract as e
df = e.use_csvs()
df.head()

                 date       d1       d2       d3       d4    v
0 2018-01-01 17:01:00  0.88831  0.88831  0.88773  0.88773  0.0
1 2018-01-01 17:02:00  0.88800  0.88800  0.88800  0.88800  0.0
2 2018-01-01 17:03:00  0.88806  0.88806  0.88806  0.88806  0.0
3 2018-01-01 17:04:00  0.88806  0.88806  0.88806  0.88806  0.0
4 2018-01-01 17:05:00  0.88818  0.88818  0.88818  0.88818  0.0
5 2018-01-01 17:06:00  0.88812  0.88812  0.88812  0.88812  0.0
6 2018-01-01 17:07:00  0.88773  0.88773  0.88762  0.88768  0.0
7 2018-01-01 17:08:00  0.88770  0.88785  0.88770  0.88785  0.0
8 2018-01-01 17:09:00  0.88781  0.88795  0.88781  0.88795  0.0
9 2018-01-01 17:10:00  0.88792  0.88792  0.88770  0.88770  0.0

                 date       d1       d2       d3       d4    v
0 2018-01-01 17:01:00  0.88831  0.88831  0.88773  0.88773  0.0
1 2018-01-01 17:02:00  0.88800  0.88800  0.88800  0.88800  0.0
2 2018-01-01 17:03:00  0.88806  0.88806  0.88806  0.88806  0.0
3 2018-01-01 17:04:00  0.88806  0.88806  0.88806  0.88806  0.0
4 2018-01-01 17:05:00  0.88818  0.88818  0.88818  0.88818  0.0

In [2]:
%timeit df['year'] = pd.DatetimeIndex(df['date']).year
%timeit df['month'] = pd.DatetimeIndex(df['date']).month
%timeit df['week'] = pd.DatetimeIndex(df['date']).week
%timeit df['day'] = pd.DatetimeIndex(df['date']).day
%timeit df['hour'] = pd.DatetimeIndex(df['date']).hour

35.4 ms ± 1.39 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)
34.4 ms ± 831 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)
45 ms ± 5.85 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)
35.9 ms ± 2.03 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)
34.1 ms ± 937 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [4]:
from calendar import monthrange

In [7]:
%load_ext Cython

In [ ]:
df['month'] = df['month'])

In [8]:
%timeit df['daysinmonth'] = df.apply(lambda row: monthrange(row['year'], row['month']), axis=1).str[1]

In [52]:
#df.groupby(['year', 'month']).sum().cumsum().reset_index().apply(lambda row: monthrange(row['year'], row['month']), axis=1).str[1]
df['not_dupym'] = 1 - df[['month', 'year']].duplicated()
#.apply(lambda row: monthrange(row['year'], row['month']))
#.str[1]
#['daysinmonth'].sum().cumsum().reset_index().groupby(['year','daysinmonth'])
#['month'].sum().transform(lambda x: x+1).reset_index()

In [124]:
#df = df.merge(
df[df['not_dupym']==1].groupby(['year', 'month'], as_index=False)['year', 'month'].sum().apply(lambda row: monthrange(row['year'].astype('int'), row['month'].astype('int')), axis=1).str[1].reset_index().rename(columns={0:"a"})
#, on = ['year', 'month'], how = 'left')

    year  month   a
0   2018      1  31
1   2018      2  28
2   2018      3  31
3   2018      4  30
4   2018      5  31
5   2018      6  30
6   2018      7  31
7   2018      8  31
8   2018      9  30
9   2018     10  31
10  2018     11  30
11  2018     12  31

In [101]:
df.head()

,date,d1,d2,d3,d4,v,year,month,week,day,hour,daysinmonth,not_dupym,0
0,2018-01-01 17:01:00,0.88831,0.88831,0.88773,0.88773,0.0,2018,1,1,1,17,31,1,31
1,2018-01-01 17:02:00,0.88800,0.88800,0.88800,0.88800,0.0,2018,1,1,1,17,31,0,31
2,2018-01-01 17:03:00,0.88806,0.88806,0.88806,0.88806,0.0,2018,1,1,1,17,31,0,31
3,2018-01-01 17:04:00,0.88806,0.88806,0.88806,0.88806,0.0,2018,1,1,1,17,31,0,31
4,2018-01-01 17:05:00,0.88818,0.88818,0.88818,0.88818,0.0,2018,1,1,1,17,31,0,31